fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ДниОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресХранилища = Параметры.АдресДанных;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ЗаполнитьДиаграммуГанта(ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ОтпускаСотрудников)
	
	ЭлементДиаграммыГанта = Элементы.ГрафикОтпусков;
	
	ЭлементДиаграммыГанта.Заголовок = "График отпусков";
	ТаблицаСотрудники = ОтпускаСотрудников.Отпуска.ВыгрузитьКолонку("Сотрудник");
	
	Серия = ГрафикОтпусков.Серии.Добавить();
	Серия.Текст = "Отпуск";
	Серия.Цвет = WebЦвета.Оливковый;
	Серия.ДополнительныйЦвет = WebЦвета.Голубой;
	
	ТочкаГод = ГрафикОтпусков.Точки.Добавить();
	ТочкаГод.Текст = "2025";
	
	Для Каждого СтрокаТаблицыСотрудник Из ТаблицаСотрудники Цикл
		
		ТочкаСотрудник = ТочкаГод.Точки.Добавить();
		ТочкаСотрудник.Значение = СтрокаТаблицыСотрудник;
		ТочкаСотрудник.Текст = СтрокаТаблицыСотрудник;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", СтрокаТаблицыСотрудник);
		
		НайденныеСтроки = ОтпускаСотрудников.Отпуска.НайтиСтроки(Отбор);
		
		Счетчик = 0;
		
		Для Каждого СтрокаДатыОтпуска Из НайденныеСтроки Цикл
			
			Счетчик = Счетчик + 1; 
			
			ТочкаДатыОтпуска = ТочкаСотрудник.Точки.Добавить();
			ТочкаДатыОтпуска.Значение = (Строка(СтрокаТаблицыСотрудник) + "_" + Строка(СтрокаДатыОтпуска.ИсходныйНомерСтроки));
			ТочкаДатыОтпуска.Текст = Строка(Счетчик) + "период. дней отпуска: " + Строка((СтрокаДатыОтпуска.ДатаОкончания - СтрокаДатыОтпуска.ДатаНачала)/86400 + 1);
			
			ЗначениеГод = ГрафикОтпусков.ПолучитьЗначение(ТочкаГод, Серия);
			ЗначениеСотрудник = ГрафикОтпусков.ПолучитьЗначение(ТочкаСотрудник, Серия);
			Значение = ГрафикОтпусков.ПолучитьЗначение(ТочкаДатыОтпуска, Серия);
			
			ИнтервалГод = ЗначениеГод.Добавить();
			ИнтервалГод.Начало = СтрокаДатыОтпуска.ДатаНачала;
			ИнтервалГод.Конец = СтрокаДатыОтпуска.ДатаОкончания;
			ИнтервалГод.Цвет = WebЦвета.Пшеничный;
			
			ИнтервалСотрудник = ЗначениеСотрудник.Добавить();
			ИнтервалСотрудник.Начало = СтрокаДатыОтпуска.ДатаНачала;
			ИнтервалСотрудник.Конец = СтрокаДатыОтпуска.ДатаОкончания;
			ИнтервалСотрудник.Цвет = WebЦвета.Коралловый;
			ИнтервалСотрудник.Текст = "с " + Строка(Формат(СтрокаДатыОтпуска.ДатаНачала, "ДЛФ=DD")) + " по " + Строка(Формат(СтрокаДатыОтпуска.ДатаОкончания, "ДЛФ=DD"));
			
			Интервал = Значение.Добавить();
			Интервал.Начало = СтрокаДатыОтпуска.ДатаНачала;
			Интервал.Конец = СтрокаДатыОтпуска.ДатаОкончания;
			Интервал.Цвет = WebЦвета.БледноЛиловый;
			Интервал = "с " + Строка(Формат(СтрокаДатыОтпуска.ДатаНачала, "ДЛФ=DD")) + " по " + Строка(Формат(СтрокаДатыОтпуска.ДатаОкончания, "ДЛФ=DD"));
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
